app/workers/chat_create_worker.rb

INSERT INTO `chats` (`number`, `application_id`, `created_at`, `updated_at`, `name`) VALUES (1, 1, '2022-11-07 08:01:19.179522', '2022-11-07 08:01:19.179522', 'first_chat_first_app')
---
  def work(msg)
    begin
        data = ActiveSupport::JSON.decode(msg)
        chat = Chat.new(data)
        chat.save!