app/workers/message_create_worker.rb

INSERT INTO `messages` (`number`, `body`, `chat_id`, `created_at`, `updated_at`) VALUES (1, 'first_message', 1, '2022-11-07 08:02:19.951175', '2022-11-07 08:02:19.951175')
---
  def work(msg)
    begin
        data = ActiveSupport::JSON.decode(msg)
        message = Message.new(data)
        message.save!