app/controllers/applications_controller.rb

  def index
    @applicationchats = @application.chats.all.select(:'chats.number',
      :'chats.name',:'chats.created_at',
      :'chats.updated_at',
      :'chats.messages_count')
---
SELECT `chats`.`number`, `chats`.`name`, `chats`.`created_at`, `chats`.`updated_at`, `chats`.`messages_count` FROM `chats` WHERE `chats`.`application_id` = 1

  def create
    @napplication = Application.create!(application_params)
---
INSERT INTO `applications` (`app_token`, `name`, `created_at`, `updated_at`) VALUES ('5dac8751-f2f5-4070-ae71-79559dabf611', 'first-app', '2022-11-07 08:00:26.752662', '2022-11-07 08:00:26.752662')

  def update
    @application.update(application_params)
---
UPDATE `applications` SET `applications`.`name` = 'updated_name', `applications`.`updated_at` = '2022-11-07 08:00:48.456764' WHERE `applications`.`id` = 1

  def set_application
    @application = Application.find_by(app_token: params[:app_token])
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`app_token` = '5dac8751-f2f5-4070-ae71-79559dabf611' LIMIT 1