app/controllers/chats_controller.rb

  def index
    @chatmessages = @chat.messages.all.select(
      :'messages.number',
      :'messages.body',
      :'messages.created_at',
      :'messages.updated_at')
---
SELECT `messages`.`number`, `messages`.`body`, `messages`.`created_at`, `messages`.`updated_at` FROM `messages` WHERE `messages`.`chat_id` = 1

  def update
    @new_params=chat_params.to_unsafe_h
    @new_params.delete :app_token
    @new_params.delete :controller
    @new_params.delete :action
    @chat.update(@new_params)
---
UPDATE `chats` SET `chats`.`updated_at` = '2022-11-07 08:01:45.842408', `chats`.`name` = 'test name' WHERE `chats`.`id` = 1

  def set_chat
    @chat = @application.chats.find_by!(number: params[:number]) or not_found
---
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 1 AND `chats`.`number` = 1 LIMIT 1

  def set_application
  	@application=Application.find_by!(app_token: params[:app_token])  or not_found
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`app_token` = '5dac8751-f2f5-4070-ae71-79559dabf611' LIMIT 1