app/controllers/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 1 AND `messages`.`number` = 1 LIMIT 1
---
  def set_message
    @message = @chat.messages.find_by!(number: params[:number]) or not_found

SELECT `chats`.* FROM `chats` INNER JOIN `applications` `application` ON `application`.`id` = `chats`.`application_id` WHERE `application`.`app_token` = 'b7051eae-98a7-4e09-846d-04d01d0b4166' AND `chats`.`number` = 1 ORDER BY `chats`.`id` ASC LIMIT 1
---
  def set_chat
  	@chat = Chat.joins(:application).where(application: {app_token: params[:app_token]}).where(chats: {number: params[:chat_number]}).first  or not_found